{
  "ABCAPITAL.BO": [
    {
      "title": "India's Grasim posts higher profit on chemicals strength; paint unit CEO resigns",
      "link": "https://finance.yahoo.com/news/indias-grasim-posts-higher-profit-095803782.html",
      "publisher": "Reuters",
      "time": "2025-11-05T09:58:03Z",
      "summary": "(Reuters) -India's Grasim Industries reported a rise in second-quarter profit on Wednesday, on the back of higher demand for its chemicals products."
    },
    {
      "title": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) Q2 2026 Earnings Call Highlights: Strong Growth in ...",
      "link": "https://finance.yahoo.com/news/aditya-birla-capital-ltd-nse-201915335.html",
      "publisher": "GuruFocus.com",
      "time": "2025-10-30T20:19:15Z",
      "summary": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) reports robust growth in key segments despite facing operational cost pressures and regulatory challenges."
    },
    {
      "title": "Advent International's arm exits India's Aditya Birla Capital, exchange data shows",
      "link": "https://finance.yahoo.com/news/advent-internationals-arm-exits-indias-113320502.html",
      "publisher": "Reuters",
      "time": "2025-10-29T11:33:20Z",
      "summary": "(Reuters) -U.S.-based private equity investor Advent International's affiliate Jomei Investments has exited its entire 2% equity stake in India's Aditya Birla Capital, exchange data showed on Tuesday."
    },
    {
      "title": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) Q1 2026 Earnings Call Highlights: Strong Growth in ...",
      "link": "https://finance.yahoo.com/news/aditya-birla-capital-ltd-nse-070859665.html",
      "publisher": "GuruFocus.com",
      "time": "2025-08-05T07:08:59Z",
      "summary": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) reports robust growth in key segments, despite facing headwinds in the unsecured MSME sector."
    },
    {
      "title": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) Q4 2025 Earnings Call Highlights: Strong Growth in ...",
      "link": "https://finance.yahoo.com/news/aditya-birla-capital-ltd-nse-070410252.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-14T07:04:10Z",
      "summary": "Aditya Birla Capital Ltd (NSE:ABCAPITAL) reports a robust 24% sequential increase in profit, driven by significant gains in NBFC disbursements and housing finance AUM."
    }
  ],
  "ARE&M.BO": [
    {
      "title": "Search Intel: ARE&M",
      "link": "https://www.google.com/search?q=ARE%26M%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413052,
      "summary": "No direct news feed detected for ARE&M. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "BAJAJ-AUTO.BO": [
    {
      "title": "India's MRF posts higher quarterly profit on strong tyre demand",
      "link": "https://finance.yahoo.com/news/indias-mrf-posts-higher-quarterly-070201945.html",
      "publisher": "Reuters",
      "time": "2025-11-14T07:02:01Z",
      "summary": "(Reuters) -Indian tyre maker MRF reported a 12.3% rise in second-quarter profit on Friday, helped by demand for its tyres by original equipment manufacturers."
    },
    {
      "title": "India's Bajaj Auto's quarterly profit rises on higher exports",
      "link": "https://finance.yahoo.com/news/indias-bajaj-autos-quarterly-profit-115241768.html",
      "publisher": "Reuters",
      "time": "2025-11-07T11:52:41Z",
      "summary": "(Reuters) -Indian automaker Bajaj Auto reported a 23.7% rise in second-quarter profit on Friday, boosted by higher exports of its motorcycles amid sluggish domestic demand."
    },
    {
      "title": "India's Amara Raja posts second-quarter profit beat on tax-cut driven demand",
      "link": "https://finance.yahoo.com/news/indias-amara-raja-posts-second-121133949.html",
      "publisher": "Reuters",
      "time": "2025-11-06T12:11:33Z",
      "summary": "(Reuters) -India's Amara Raja Energy and Mobility reported a bigger-than-expected rise in second-quarter profit on Thursday, driven by increased demand from automotive manufacturers following India's"
    },
    {
      "title": "IPO-bound Indian EV startup Simple Energy plans aggressive expansion by 2029",
      "link": "https://finance.yahoo.com/news/ipo-bound-indian-ev-startup-092946944.html",
      "publisher": "Reuters",
      "time": "2025-09-30T09:29:46Z",
      "summary": "(Corrects market share to about 0.5% from about 5% in paragraph 4 after company clarification) By Meenakshi Maidas and Yagnoseni Das (Reuters) -Simple Energy, an Indian electric two-wheeler"
    },
    {
      "title": "Indian automaker Bajaj Auto's rare earths supply improves, MD tells CNBC-TV18",
      "link": "https://finance.yahoo.com/news/indian-automaker-bajaj-autos-rare-085851128.html",
      "publisher": "Reuters",
      "time": "2025-08-22T08:58:51Z",
      "summary": "China, which controls 90% of the global production of rare earths, banned its export in April, forcing automakers including Bajaj Auto and its peers to search for alternatives amid a scramble for supplies.  India's festival season, which begins from late August in some parts and is stretches into October, is considered an auspicious time for big-ticket purchases like vehicles."
    }
  ],
  "BIOCON.BO": [
    {
      "title": "US proposal to halve biosimilar development costs for India's Biocon, top exec says",
      "link": "https://finance.yahoo.com/news/us-proposal-halve-biosimilar-development-081737320.html",
      "publisher": "Reuters",
      "time": "2025-11-13T08:21:51Z",
      "summary": "By Rishika Sadam (Reuters) -India's Biocon expects a 50% drop in costs for developing complex biosimilars as the United States has proposed to ease clinical testing for the drugs that make up more"
    },
    {
      "title": "Biocon Ltd (BOM:532523) (HY 2026) Earnings Call Highlights: Strong Growth in Biosimilars and ...",
      "link": "https://finance.yahoo.com/news/biocon-ltd-bom-532523-hy-110105278.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-12T11:01:05Z",
      "summary": "Biocon Ltd (BOM:532523) reports robust performance with new product launches and strategic debt management, despite challenges in competitive markets."
    },
    {
      "title": "How the Evolving Story Shapes Analyst Views on Biocon’s Strengths and Challenges",
      "link": "https://finance.yahoo.com/news/evolving-story-shapes-analyst-views-124843932.html",
      "publisher": "Simply Wall St.",
      "time": "2025-10-06T12:48:43Z",
      "summary": "Biocon's consensus analyst price target has seen a minor decrease, dropping from ₹380.11 to ₹376.70. This indicates a slight reassessment of fair value by market experts. This change comes amid a landscape of both optimism and caution, as analysts weigh the company's long-term growth prospects against ongoing execution challenges. Stay tuned to discover how investors can remain informed about evolving perspectives and ensure they keep pace with the shifting narrative around Biocon stock. What..."
    },
    {
      "title": "India's Biocon drops plan to launch weight-loss drugs in China, executive says",
      "link": "https://finance.yahoo.com/news/indias-biocon-drops-plan-launch-045953552.html",
      "publisher": "Reuters",
      "time": "2025-06-27T04:59:53Z",
      "summary": "SHANGHAI (Reuters) -Indian drugmaker Biocon has abandoned plans to market generic versions of Novo Nordisk’s hot-selling diabetes and weight-loss drugs in China due to local competition, a senior executive said.  \"We decided not to do it in China, not supply or register the product in China, either finished product or the API, because there is ample capacity and players available in China,\" Amit Kaptain, head of Biocon's commercial active pharmaceutical ingredients (API) business, told Reuters in Shanghai."
    },
    {
      "title": "Biocon Ltd (BOM:532523) (Q4 2025) Earnings Call Highlights: Strong Revenue Growth Amidst Market ...",
      "link": "https://finance.yahoo.com/news/biocon-ltd-bom-532523-q4-070037700.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-10T07:00:37Z",
      "summary": "Biocon Ltd (BOM:532523) reports robust Q4 revenue growth driven by Generics and Biosimilars, while addressing market pressures and strategic expansions."
    }
  ],
  "CIPLA.BO": [
    {
      "title": "India's Lupin posts surge in quarterly profit on strong respiratory drugs demand",
      "link": "https://finance.yahoo.com/news/indias-lupin-posts-surge-quarterly-141032456.html",
      "publisher": "Reuters",
      "time": "2025-11-06T14:10:32Z",
      "summary": "(Reuters) -Indian drugmaker Lupin posted a 73.3% jump in second-quarter profit on Thursday, driven by strong demand for its respiratory drugs."
    },
    {
      "title": "India's Alembic Pharma posts quarterly profit jump on strong generics demand",
      "link": "https://finance.yahoo.com/news/indias-alembic-pharma-posts-quarterly-095351316.html",
      "publisher": "Reuters",
      "time": "2025-11-04T09:53:51Z",
      "summary": "(Reuters) -Indian drugmaker Alembic Pharmaceuticals posted a 20.4% rise in second-quarter profit on Tuesday, aided by strong demand for its generic drugs as well as new launches in its key U.S. market"
    },
    {
      "title": "India's Gland Pharma posts higher quarterly profit on Cenexi boost",
      "link": "https://finance.yahoo.com/news/indias-gland-pharma-posts-higher-114340948.html",
      "publisher": "Reuters",
      "time": "2025-11-03T11:43:40Z",
      "summary": "(Reuters) -India's Gland Pharma reported a 12% rise in second-quarter profit on Monday, as recovery at its European unit Cenexi bolstered margins."
    },
    {
      "title": "Indian drugmaker Cipla's global CEO Umang Vohra to step down, COO to take over",
      "link": "https://finance.yahoo.com/news/indian-drugmaker-ciplas-global-ceo-115309998.html",
      "publisher": "Reuters",
      "time": "2025-10-30T11:53:09Z",
      "summary": "By Rishika Sadam and Kashish Tandon (Reuters) -Cipla's global chief executive and managing director, Umang Vohra, will step down at the end of March after almost a decade in the top role, the Indian"
    },
    {
      "title": "Eli Lilly allows Cipla to sell weight loss drug under new brand in India",
      "link": "https://finance.yahoo.com/news/eli-lilly-allows-cipla-sell-103656117.html",
      "publisher": "Reuters",
      "time": "2025-10-23T10:36:56Z",
      "summary": "(Reuters) -Eli Lilly signed an agreement with Cipla, allowing the Indian drugmaker to sell its blockbuster weight-loss drug under a separate brand in the country, the companies said on Thursday."
    }
  ],
  "COSMOFIRST.BO": [
    {
      "title": "Cosmo Films USA expands North American operations with high-speed slitter rewinder",
      "link": "https://finance.yahoo.com/news/cosmo-films-usa-expands-north-135200780.html",
      "publisher": "Packaging Gateway",
      "time": "2025-08-01T13:52:00Z",
      "summary": "The new slitter will allow the company to fulfil customer orders within 10 to 15 days from order dates."
    }
  ],
  "CUB.BO": [
    {
      "title": "City Union Bank Ltd (BOM:532210) Q2 2026 Earnings Call Highlights: Record Growth in Advances ...",
      "link": "https://finance.yahoo.com/news/city-union-bank-ltd-bom-190052243.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-03T19:00:52Z",
      "summary": "City Union Bank Ltd (BOM:532210) reports robust financial performance with significant improvements in asset quality and strategic focus on sustainable finance."
    }
  ],
  "DRREDDY.BO": [
    {
      "title": "Immutep (IMMP) Scores Win After Announcing Deal With Indian Firm",
      "link": "https://finance.yahoo.com/news/immutep-immp-scores-win-announcing-173521195.html",
      "publisher": "Insider Monkey",
      "time": "2025-12-15T17:35:21Z",
      "summary": "We recently published 7 Best ASX Stocks to Buy Right Now. Immutep Limited (NASDAQ:IMMP) is one of the best ASX stocks. Immutep Limited (NASDAQ:IMMP) is a biotechnology company developing therapies for cancer and autoimmune diseases. The firm’s shares underwent notable traction earlier this week after Indian firm Dr. Reddy’s Laboratories Ltd.’s subsidiary entered into an […]"
    },
    {
      "title": "Zacks Industry Outlook Highlights Sandoz, Teva Pharmaceuticals and Dr. Reddy's",
      "link": "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-sandoz-095300583.html",
      "publisher": "Zacks",
      "time": "2025-12-09T09:53:00Z",
      "summary": "Sandoz, Teva and Dr. Reddy's emerge as standouts as generic drugmakers lean on biosimilars, complex generics and tighter cost controls."
    },
    {
      "title": "3 Generic Drug Stocks to Watch Amid Changing U.S. Landscape",
      "link": "https://finance.yahoo.com/news/3-generic-drug-stocks-watch-132300289.html",
      "publisher": "Zacks",
      "time": "2025-12-08T13:23:00Z",
      "summary": "Generic drugmakers face U.S. pricing pressure, but TEVA, SDZNY and RDY gain momentum through complex generics and biosimilars."
    },
    {
      "title": "Sector Update: Health Care Stocks Lower Late Afternoon",
      "link": "https://finance.yahoo.com/news/sector-health-care-stocks-lower-205656620.html",
      "publisher": "MT Newswires",
      "time": "2025-12-05T20:56:56Z",
      "summary": "Health care stocks declined late Friday afternoon, with the NYSE Health Care Index falling 0.3% and"
    },
    {
      "title": "Update: Novo Nordisk Loses India Case to Halt Dr. Reddy's Production of Generic Semaglutide",
      "link": "https://finance.yahoo.com/news/novo-nordisk-loses-india-case-104448280.html",
      "publisher": "MT Newswires",
      "time": "2025-12-05T10:44:48Z",
      "summary": "(Updates with Novo Nordisk's response in the sixth paragraph.) Novo Nordisk (NVO) has lost an Ind"
    }
  ],
  "EXIDEIND.BO": [
    {
      "title": "India tax authority conducts survey at Exide Industries",
      "link": "https://finance.yahoo.com/news/india-tax-authority-conducts-survey-085459148.html",
      "publisher": "Reuters",
      "time": "2025-10-30T08:54:59Z",
      "summary": "BENGALURU (Reuters) -India's Income Tax Department is conducting a survey at Exide Industries' offices and manufacturing units, the battery maker said on Thursday."
    },
    {
      "title": "Exide Industries Ltd (BOM:500086) Q4 2025 Earnings Call Highlights: Navigating Challenges with ...",
      "link": "https://finance.yahoo.com/news/exide-industries-ltd-bom-500086-070050841.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-07T07:00:50Z",
      "summary": "Despite facing high input costs and market challenges, Exide Industries Ltd (BOM:500086) reports robust growth in key segments and significant investments in lithium-ion technology."
    }
  ],
  "FEDERALBNK.BO": [
    {
      "title": "What New Signals Are Shaping the Evolving Narrative for Federal Bank?",
      "link": "https://finance.yahoo.com/news/signals-shaping-evolving-narrative-federal-100850805.html",
      "publisher": "Simply Wall St.",
      "time": "2025-12-04T10:08:50Z",
      "summary": "Federal Bank’s latest analyst update keeps the consensus price target steady at ₹246.03, even as a slightly lower discount rate hints at reduced perceived risk and a more supportive macro backdrop. With revenue growth expectations and other core assumptions virtually unchanged, the revised narrative reflects balanced optimism on execution alongside caution that much of the good news may already be priced in. Read on to see how you can track these evolving analyst signals and stay ahead of..."
    },
    {
      "title": "Deutsche Bank Intends to Divest Indian Retail and Wealth Unit",
      "link": "https://finance.yahoo.com/news/deutsche-bank-intends-divest-indian-160400125.html",
      "publisher": "Zacks",
      "time": "2025-11-21T16:04:00Z",
      "summary": "DB plans to sell its India retail and wealth unit, a move that could reshape its footprint as it pursues a sharper strategic focus."
    },
    {
      "title": "Deutsche Bank in discussions to sell India retail and wealth business – report",
      "link": "https://finance.yahoo.com/news/deutsche-bank-discussions-sell-india-131040489.html",
      "publisher": "Retail Banker International",
      "time": "2025-11-21T13:10:40Z",
      "summary": "Kotak Mahindra Bank, Federal Bank, and Emirates NBD India have reviewed the portfolio and are engaged in negotiations."
    },
    {
      "title": "How Analyst Perspectives Are Shaping Federal Bank’s Evolving Growth Story",
      "link": "https://finance.yahoo.com/news/analyst-perspectives-shaping-federal-bank-091356393.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-20T09:13:56Z",
      "summary": "Federal Bank's fair value estimate has seen a slight increase, moving from ₹243.65 to ₹246.03 as analysts revise their outlooks. This change reflects a blend of optimism and caution from the latest research, where some experts highlight improving growth prospects while others remain wary about sector challenges. Stay tuned to discover how you can keep track of the evolving narrative and make informed decisions as this story develops. Stay updated as the Fair Value for Federal Bank shifts by..."
    },
    {
      "title": "What the Latest Developments Mean for Federal Bank’s Evolving Investment Story",
      "link": "https://finance.yahoo.com/news/latest-developments-mean-federal-bank-212442108.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-05T21:24:42Z",
      "summary": "Federal Bank’s stock has seen its fair value estimate rise from ₹228.12 to ₹243.65, reflecting renewed optimism among analysts. This adjustment follows incremental shifts in growth and discount rate assumptions. The changes point to a moderately higher intrinsic worth for the bank. Stay tuned to understand how investors can keep pace with these evolving assessments as market dynamics continue to shift. Analyst Price Targets don't always capture the full story. Head over to our Company Report..."
    }
  ],
  "HCLTECH.BO": [
    {
      "title": "ASN Bank selects HCLTech to support digital transformation",
      "link": "https://finance.yahoo.com/news/asn-bank-selects-hcltech-support-112628707.html",
      "publisher": "Retail Banker International",
      "time": "2025-12-18T11:26:28Z",
      "summary": "The collaboration is part of ASN Bank’s ‘Simplify and Grow’ strategy, which aims to modernise and standardise its IT architecture."
    },
    {
      "title": "Amazon.com, Inc. (AMZN) Strengthens AI Momentum with HCLTech Partnership",
      "link": "https://finance.yahoo.com/news/amazon-com-inc-amzn-strengthens-062131403.html",
      "publisher": "Insider Monkey",
      "time": "2025-11-28T06:21:31Z",
      "summary": "Amazon.com Inc. (NASDAQ:AMZN) is one of the AI stocks analysts are betting on. HCLTech announced a new partnership with Amazon Web Services on November 25, aimed at speeding up innovation in the financial services sector. By combining HCLTech’s industry expertise with AWS’s cloud and AI capabilities, the two companies plan to help banks and insurers […]"
    },
    {
      "title": "Zscaler (ZS): Evaluating Valuation After Analyst Upgrades and Major AI Security Partnership with HCLTech",
      "link": "https://finance.yahoo.com/news/zscaler-zs-evaluating-valuation-analyst-201100451.html",
      "publisher": "Simply Wall St.",
      "time": "2025-10-24T20:11:00Z",
      "summary": "Recent coverage highlights Zscaler (ZS) as a primary beneficiary of strengthening industry trends, from accelerated AI adoption to increased enterprise cybersecurity budgets. The company’s expanded partnership with HCLTech further emphasizes its leadership in cloud-first, zero trust security solutions. See our latest analysis for Zscaler. Momentum has clearly been on Zscaler's side, with a 75% year-to-date share price return reflecting market confidence in its growth story and a 73% total..."
    },
    {
      "title": "Dubai Islamic Bank forges alliance HCLTech to integrate AI",
      "link": "https://finance.yahoo.com/news/dubai-islamic-bank-forges-alliance-104645060.html",
      "publisher": "Retail Banker International",
      "time": "2025-10-22T10:46:45Z",
      "summary": "This partnership is aimed at enhancing the bank's operational capabilities through the scalable application of AI."
    },
    {
      "title": "India's LTIMindtree beats second-quarter earnings view on BFSI strength",
      "link": "https://finance.yahoo.com/news/indias-ltimindtree-beats-second-quarter-113810431.html",
      "publisher": "Reuters",
      "time": "2025-10-16T11:38:10Z",
      "summary": "BENGALURU (Reuters) -Indian IT services company LTIMindtree reported bigger-than-expected quarterly earnings on Thursday on strong performance in the banking, financial services and insurance (BFSI)"
    }
  ],
  "HDFCBANK.BO": [
    {
      "title": "RBI approves HDFC subsidiaries to buy 9.5% stake in IndusInd Bank",
      "link": "https://finance.yahoo.com/news/rbi-approves-hdfc-subsidiaries-buy-115535109.html",
      "publisher": "Retail Banker International",
      "time": "2025-12-17T11:55:35Z",
      "summary": "HDFC units are allowed to jointly purchase up to 9.5% of IndusInd Bank’s paid-up share capital or voting rights, within one year."
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Decline in Wednesday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-153651176.html",
      "publisher": "MT Newswires",
      "time": "2025-12-03T15:36:51Z",
      "summary": "Asian equities traded in the US as American depositary receipts were trending lower Wednesday mornin"
    },
    {
      "title": "India's Kotak Mahindra Bank announces first stock split in 15 years",
      "link": "https://finance.yahoo.com/news/indias-kotak-mahindra-bank-announces-105828631.html",
      "publisher": "Reuters",
      "time": "2025-11-21T10:58:28Z",
      "summary": "(Reuters) -India's Kotak Mahindra Bank said on Friday it will split one share into five, in its first stock split since September 2010."
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Rise in Thursday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-154829328.html",
      "publisher": "MT Newswires",
      "time": "2025-11-20T15:48:29Z",
      "summary": "Asian equities traded in the US as American depositary receipts were tracking higher Thursday mornin"
    },
    {
      "title": "HDB or CMWAY: Which Is the Better Value Stock Right Now?",
      "link": "https://finance.yahoo.com/news/hdb-cmway-better-value-stock-164006398.html",
      "publisher": "Zacks",
      "time": "2025-11-10T16:40:06Z",
      "summary": "HDB vs. CMWAY: Which Stock Is the Better Value Option?"
    }
  ],
  "HEROMOTOCO.BO": [
    {
      "title": "Hero MotoCorp Ltd (BOM:500182) Q2 2026 Earnings Call Highlights: Record Revenue and Market ...",
      "link": "https://finance.yahoo.com/news/hero-motocorp-ltd-bom-500182-010035360.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-24T01:00:35Z",
      "summary": "Hero MotoCorp Ltd (BOM:500182) achieves its highest ever quarterly revenue and significant market share growth, while navigating commodity price pressures and EV profitability hurdles."
    },
    {
      "title": "Indian two-wheeler maker Hero MotoCorp tops profit view on tax-cut fueled demand, strong exports",
      "link": "https://finance.yahoo.com/news/indian-two-wheeler-maker-hero-144851067.html",
      "publisher": "Reuters",
      "time": "2025-11-13T14:48:51Z",
      "summary": "(Reuters) -Hero MotoCorp, India's top two-wheeler maker by sales, reported a better-than-expected quarterly profit on Thursday, on the back of demand fueled by domestic tax cuts as well as strong"
    },
    {
      "title": "Indian e-scooter maker Ather Energy posts narrower quarterly loss",
      "link": "https://finance.yahoo.com/news/indian-e-scooter-maker-ather-140530541.html",
      "publisher": "Reuters",
      "time": "2025-11-10T14:05:30Z",
      "summary": "(Reuters) -Indian e-scooter maker Ather Energy reported a narrower loss for the second quarter on Monday, as more stores helped drive sales of models such as the Rizta."
    },
    {
      "title": "India's Amara Raja posts second-quarter profit beat on tax-cut driven demand",
      "link": "https://finance.yahoo.com/news/indias-amara-raja-posts-second-121133949.html",
      "publisher": "Reuters",
      "time": "2025-11-06T12:11:33Z",
      "summary": "(Reuters) -India's Amara Raja Energy and Mobility reported a bigger-than-expected rise in second-quarter profit on Thursday, driven by increased demand from automotive manufacturers following India's"
    },
    {
      "title": "Castrol India's third-quarter profit rises on strong automotive lubricants demand",
      "link": "https://finance.yahoo.com/news/castrol-indias-third-quarter-profit-094038019.html",
      "publisher": "Reuters",
      "time": "2025-11-04T09:40:38Z",
      "summary": "(Reuters) -Engine oil maker Castrol India posted a 9.8% rise in third-quarter profit on Tuesday, supported by steady demand for its automotive lubricants."
    }
  ],
  "HINDUNILVR.BO": [
    {
      "title": "PE firm L Catterton invests in Indian snacks major Haldiram’s",
      "link": "https://finance.yahoo.com/news/l-catterton-invests-halidram-under-121432574.html",
      "publisher": "Just Food",
      "time": "2025-12-18T16:57:07Z",
      "summary": "L Catterton's investment aims to \"foster a global 'India for the world' brand\"."
    },
    {
      "title": "How New Risks and Catalysts Are Shaping the Evolving Narrative for Hindustan Unilever",
      "link": "https://finance.yahoo.com/news/risks-catalysts-shaping-evolving-narrative-050632036.html",
      "publisher": "Simply Wall St.",
      "time": "2025-12-15T05:06:32Z",
      "summary": "Hindustan Unilever’s latest narrative update reflects only a subtle recalibration in its fair value roadmap, with the fair value estimate nudged down from about ₹2,786 to roughly ₹2,784 per share, as analysts balance strong brand fundamentals against a more nuanced view of execution and category risks. This is mirrored in a slightly lower discount rate of around 13.52% and a marginally softer long term revenue growth assumption of nearly 9.32%. Together, these shifts capture both the premium..."
    },
    {
      "title": "How Recent Analyst Updates Are Shaping the Story Behind Hindustan Unilever’s Valuation",
      "link": "https://finance.yahoo.com/news/recent-analyst-updates-shaping-story-150723426.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-30T15:07:23Z",
      "summary": "Hindustan Unilever's consensus analyst price target has decreased slightly from ₹2,786.66 to ₹2,786.61, reflecting nuanced shifts in market sentiment. This comes as analysts reassess the company’s prospects, considering both resilient demand and ongoing industry headwinds in their models. Stay tuned to discover how you can track ongoing updates and changes in the stock’s evolving narrative. Analyst Price Targets don't always capture the full story. Head over to our Company Report to find new..."
    },
    {
      "title": "How the Narrative Surrounding Hindustan Unilever Is Evolving After Recent Analyst Updates",
      "link": "https://finance.yahoo.com/news/narrative-surrounding-hindustan-unilever-evolving-050813977.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-16T05:08:13Z",
      "summary": "Hindustan Unilever’s fair value estimate has ticked up slightly in the latest update, reflecting shifts in analyst projections. Viewed against the backdrop of a modest decrease in the discount rate and subtle adjustments to growth expectations, this new price target signals nuanced optimism about the company’s future. Stay tuned to learn how investors and market watchers can keep abreast of these evolving views and incorporate them into their own analysis moving forward. Analyst Price Targets..."
    },
    {
      "title": "Britannia shares slump as veteran Varun Berry exits Indian packaged foods firm",
      "link": "https://finance.yahoo.com/news/britannia-shares-slump-veteran-varun-053925539.html",
      "publisher": "Reuters",
      "time": "2025-11-11T05:39:25Z",
      "summary": "(Reuters) -Shares of Britannia Industries fell as much as 6.7% on Tuesday after CEO and Managing Director Varun Berry resigned, ending a decade-long tenure that transformed the Indian biscuit maker"
    }
  ],
  "ICICIBANK.BO": [
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Rise Sharply in Thursday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-154109181.html",
      "publisher": "MT Newswires",
      "time": "2025-12-18T15:41:09Z",
      "summary": "Asian equities traded in the US as American depositary receipts were sharply higher Thursday morning"
    },
    {
      "title": "Do Options Traders Know Something About ICICI Bank Stock We Don't?",
      "link": "https://finance.yahoo.com/news/options-traders-know-something-icici-134900342.html",
      "publisher": "Zacks",
      "time": "2025-12-15T13:49:00Z",
      "summary": "Investors need to pay close attention to IBN stock based on the movements in the options market lately."
    },
    {
      "title": "The Zacks Analyst Blog Highlights ICICI Bank, Taiwan Semiconductor, MercadoLibre and NVIDIA",
      "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-icici-112100231.html",
      "publisher": "Zacks",
      "time": "2025-12-12T11:21:00Z",
      "summary": "Emerging-market strength sets the stage for 2026, with IBN, TSM and MELI positioned to benefit from faster growth, improving earnings and attractive valuations."
    },
    {
      "title": "Emerging Markets to Outperform: 3 Stocks for 2026 Growth & Value",
      "link": "https://finance.yahoo.com/news/emerging-markets-outperform-3-stocks-200000983.html",
      "publisher": "Zacks",
      "time": "2025-12-11T20:00:00Z",
      "summary": "IBN, TSM and MELI stand out as emerging-market plays as stronger growth, cheaper valuations and sector tailwinds set the stage for 2026 momentum."
    },
    {
      "title": "TD vs. IBN: Which Stock Is the Better Value Option?",
      "link": "https://finance.yahoo.com/news/td-vs-ibn-stock-better-164002938.html",
      "publisher": "Zacks",
      "time": "2025-12-09T16:40:02Z",
      "summary": "TD vs. IBN: Which Stock Is the Better Value Option?"
    }
  ],
  "IDFCFIRSTB.BO": [
    {
      "title": "India competition regulator approves SMBC's stake buy in Yes Bank",
      "link": "https://finance.yahoo.com/news/india-competition-regulator-approves-smbcs-120659614.html",
      "publisher": "Reuters",
      "time": "2025-09-02T12:06:59Z",
      "summary": "SMBC in May had inked a deal to take a 20% stake in Yes Bank for $1.6 billion, making it the largest cross-border merger and acquisition deal in India's financial sector.  The Japanese lender had agreed to buy a 13.19% stake from State Bank of India  and an aggregate 6.81% stake from Axis Bank , Bandhan Bank , Federal Bank, HDFC Bank , ICICI Bank , IDFC First Bank  and Kotak Mahindra Bank."
    },
    {
      "title": "Instant View: S&P Global upgrades India's sovereign credit ratings to \"BBB\"",
      "link": "https://finance.yahoo.com/news/p-global-upgrades-indias-sovereign-093931498.html",
      "publisher": "Reuters",
      "time": "2025-08-14T09:39:31Z",
      "summary": "The ratings upgrade from S&P reflects the impact of prudent fiscal policy.  The central government's quality of expenditure has improved along with a more long term focus on fiscal improvement by targeting debt."
    },
    {
      "title": "Warburg Pincus seeks CCI approval for IDFC First Bank stake",
      "link": "https://finance.yahoo.com/news/warburg-pincus-seeks-cci-nod-120842478.html",
      "publisher": "Retail Banker International",
      "time": "2025-05-02T12:08:42Z",
      "summary": "The investment in IDFC First Bank is being conducted via Currant Sea Investments, a subsidiary of Warburg Pincus."
    },
    {
      "title": "IDFC First Bank Ltd (BOM:539437) Q4 2025 Earnings Call Highlights: Strong Deposit Growth and ...",
      "link": "https://finance.yahoo.com/news/idfc-first-bank-ltd-bom-170042968.html",
      "publisher": "GuruFocus.com",
      "time": "2025-04-28T17:00:42Z",
      "summary": "IDFC First Bank Ltd (BOM:539437) reports robust growth in customer deposits and asset quality, while addressing profitability impacts from the microfinance sector."
    },
    {
      "title": "Warburg Pincus, ADIA units to invest $877 million in India's IDFC FIRST Bank",
      "link": "https://finance.yahoo.com/news/warburg-pincus-adia-invest-877-035326990.html",
      "publisher": "Reuters",
      "time": "2025-04-17T03:53:26Z",
      "summary": "IDFC FIRST Bank will issue Warburg Pincus and ADIA convertible shares, which, if fully converted, will give them a combined 15% stake in the bank.  Currant Sea Investments B.V., a Warburg Pincus affiliate, will invest 48.76 billion rupees for a 9.8% stake, while ADIA unit Platinum Invictus B 2025 RSC will invest about 26.24 billion rupees for a 5.10% stake, IDFC FIRST said."
    }
  ],
  "INDUSINDBK.BO": [
    {
      "title": "RBI approves HDFC subsidiaries to buy 9.5% stake in IndusInd Bank",
      "link": "https://finance.yahoo.com/news/rbi-approves-hdfc-subsidiaries-buy-115535109.html",
      "publisher": "Retail Banker International",
      "time": "2025-12-17T11:55:35Z",
      "summary": "HDFC units are allowed to jointly purchase up to 9.5% of IndusInd Bank’s paid-up share capital or voting rights, within one year."
    },
    {
      "title": "Exclusive-IndusInd Bank looks to claw back salary, bonuses of former top officials, sources say",
      "link": "https://finance.yahoo.com/news/exclusive-indusind-bank-looks-claw-060557061.html",
      "publisher": "Reuters",
      "time": "2025-11-11T06:05:57Z",
      "summary": "By Gopika Gopakumar and Jayshree P Upadhyay MUMBAI (Reuters) -India's IndusInd Bank has begun a process to claw back salary and bonuses from its former chief executive and deputy chief, after an"
    },
    {
      "title": "India's IndusInd Bank targets system-level growth next financial year, CEO says",
      "link": "https://finance.yahoo.com/news/indias-indusind-bank-targets-system-022951569.html",
      "publisher": "Reuters",
      "time": "2025-11-04T02:29:51Z",
      "summary": "By Gopika Gopakumar and Ira Dugal MUMBAI (Reuters) -India's IndusInd Bank expects to grow in line with the country's banking sector next year, following efforts to clean up its books and complete an"
    },
    {
      "title": "Former IndusInd Bank deputy pays 50% of alleged insider trading gains to SEBI",
      "link": "https://finance.yahoo.com/news/former-indusind-bank-deputy-pays-151515366.html",
      "publisher": "Reuters",
      "time": "2025-10-24T15:15:15Z",
      "summary": "(Reuters) -IndusInd Bank's former deputy chief has deposited 50% of the alleged insider trading gains with India's markets regulator, BSE said on Friday."
    },
    {
      "title": "India's IndusInd Bank reports net loss in first quarter after management change",
      "link": "https://finance.yahoo.com/news/indias-indusind-bank-reports-net-103610061.html",
      "publisher": "Reuters",
      "time": "2025-10-18T10:36:10Z",
      "summary": "MUMBAI (Reuters) -Indian private lender IndusInd Bank reported a net loss for the second quarter on Saturday, in its first earnings report since a new chief executive was appointed as the lender"
    }
  ],
  "INFY.BO": [
    {
      "title": "Stock Market Today, Dec. 19: NYSE Halts Infosys Trading After ADRs Spike",
      "link": "https://finance.yahoo.com/news/stock-market-today-dec-19-230204325.html",
      "publisher": "Motley Fool",
      "time": "2025-12-19T23:02:04Z",
      "summary": "Unusual trading halt and record volume spotlight rising volatility risks for U.S. investors in this tech leader, today, Dec. 19, 2025."
    },
    {
      "title": "Top Stock Reports for Walmart, Wells Fargo & Thermo Fisher Scientific",
      "link": "https://finance.yahoo.com/news/top-stock-reports-walmart-wells-220900095.html",
      "publisher": "Zacks",
      "time": "2025-12-19T22:09:00Z",
      "summary": "Walmart's omnichannel execution, strong comps and expanding higher-margin businesses are driving outperformance despite cost pressures and tariff risks."
    },
    {
      "title": "Infosys Pares Gains After Stock Spike. No One Knows What Prompted the Move.",
      "link": "https://www.barrons.com/articles/infosys-stock-price-halt-gain-0d17b503?siteid=yhoof2&yptr=yahoo",
      "publisher": "Barrons.com",
      "time": "2025-12-19T19:21:00Z",
      "summary": "Infosys has been under pressure this year on changes to H-1B visas pushed through by the Trump administration."
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Surge in Friday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-154004605.html",
      "publisher": "MT Newswires",
      "time": "2025-12-19T15:40:04Z",
      "summary": "Asian equities traded in the US as American depositary receipts were surging higher in Friday tradin"
    },
    {
      "title": "Infosys (INFY) Surges 5.3%: Is This an Indication of Further Gains?",
      "link": "https://finance.yahoo.com/news/infosys-infy-surges-5-3-085300290.html",
      "publisher": "Zacks",
      "time": "2025-12-19T08:53:00Z",
      "summary": "Infosys (INFY) saw its shares surge in the last session with trading volume being higher than average. The latest trend in earnings estimate revisions may not translate into further price increase in the near term."
    }
  ],
  "ITC.BO": [
    {
      "title": "Stocks to watch this week: Broadcom, Lululemon, British American Tobacco, Dr Martens and Rémy Cointreau",
      "link": "https://finance.yahoo.com/news/broadcom-lululemon-british-american-tobacco-dr-martens-remy-cointreau-stocks-to-watch-115059934.html",
      "publisher": "Yahoo Finance UK",
      "time": "2025-05-30T11:50:59Z",
      "summary": "Earnings preview of key companies reporting in the coming week and what to look out for."
    }
  ],
  "JYOTHYLAB.BO": [
    {
      "title": "Jyothy Labs Ltd (BOM:532926) Q2 2026 Earnings Call Highlights: Resilient Volume Growth Amid ...",
      "link": "https://finance.yahoo.com/news/jyothy-labs-ltd-bom-532926-010241742.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-19T01:02:41Z",
      "summary": "Despite GST disruptions and input cost pressures, Jyothy Labs Ltd (BOM:532926) showcases strong cash reserves and strategic expansion plans."
    }
  ],
  "KALYANKJIL.BO": [
    {
      "title": "Kalyan Jewellers India Ltd (BOM:543278) Q2 2026 Earnings Call Highlights: Record Revenue and ...",
      "link": "https://finance.yahoo.com/news/kalyan-jewellers-india-ltd-bom-010437949.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-13T01:04:37Z",
      "summary": "Kalyan Jewellers India Ltd (BOM:543278) reports a 30% revenue increase and 100% profit growth, driven by robust same-store sales and strategic store openings."
    }
  ],
  "KTKBANK.BO": [
    {
      "title": "Karnataka Bank Ltd (BOM:532652) Q2 2026 Earnings Call Highlights: Profit Surge and Strategic ...",
      "link": "https://finance.yahoo.com/news/karnataka-bank-ltd-bom-532652-170042589.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-10T17:00:42Z",
      "summary": "Karnataka Bank Ltd (BOM:532652) reports a 9.1% increase in profit after tax, while navigating margin pressures and operational cost challenges in Q2 FY26."
    },
    {
      "title": "India's Karnataka Bank drops after top boss, board member resign",
      "link": "https://finance.yahoo.com/news/indias-karnataka-bank-drops-top-051705875.html",
      "publisher": "Reuters",
      "time": "2025-06-30T05:17:05Z",
      "summary": "On Sunday, the bank said its Managing Director and Chief Executive Officer, Srikrishnan Hari Hara Sarma, had resigned, citing \"personal reasons, including his decision to relocate back to Mumbai\".  Sekhar Rao, an executive director and a member of the board, also resigned due to personal reasons."
    },
    {
      "title": "Karnataka Bank Ltd (BOM:532652) Q4 2025 Earnings Call Highlights: Strategic Expansion and Asset ...",
      "link": "https://finance.yahoo.com/news/karnataka-bank-ltd-bom-532652-071423964.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-15T07:14:23Z",
      "summary": "Karnataka Bank Ltd (BOM:532652) reports a 7% increase in business turnover and improved asset quality, despite a slight decline in profit after tax for FY25."
    },
    {
      "title": "Karnataka Bank Ltd (BOM:532652) Q3 2025 Earnings Call Highlights: Navigating Growth Amidst ...",
      "link": "https://finance.yahoo.com/news/karnataka-bank-ltd-bom-532652-070315398.html",
      "publisher": "GuruFocus.com",
      "time": "2025-02-01T07:03:15Z",
      "summary": "Despite robust advances and improved asset quality, Karnataka Bank Ltd faces profitability pressures with declining PAT and NII."
    }
  ],
  "LT.BO": [
    {
      "title": "JA Solar to supply PV modules for 1.2GW Uzbek solar projects",
      "link": "https://finance.yahoo.com/news/ja-solar-supply-pv-modules-105115016.html",
      "publisher": "Power Technology",
      "time": "2025-11-06T10:51:15Z",
      "summary": "The Samarkand 1 and 2 solar projects in central Uzbekistan are currently under development by ACWA Power."
    },
    {
      "title": "Larsen & Toubro Ltd (LTOUF) Q2 2026 Earnings Call Highlights: Robust Order Inflows and ...",
      "link": "https://finance.yahoo.com/news/larsen-toubro-ltd-ltouf-q2-010827426.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-05T01:08:27Z",
      "summary": "Larsen & Toubro Ltd (LTOUF) reports a 45% YoY increase in order inflows and strategic expansions in renewables and semiconductors, despite challenges in infrastructure and energy margins."
    },
    {
      "title": "L&T chosen for TenneT’s HV DC offshore wind programme",
      "link": "https://finance.yahoo.com/news/l-t-chosen-tennet-hv-130450413.html",
      "publisher": "Power Technology",
      "time": "2025-10-30T13:04:50Z",
      "summary": "The programme is set to expedite the integration of extensive renewable energy sources into the European power grid."
    },
    {
      "title": "India's L&T posts profit rise, forecasts annual order outlook beat",
      "link": "https://finance.yahoo.com/news/indias-l-t-posts-profit-145438792.html",
      "publisher": "Reuters",
      "time": "2025-10-29T14:54:38Z",
      "summary": "By Sethuraman N R and Hritam Mukherjee NEW DELHI/BENGALURU (Reuters) -India's Larsen & Toubro said on Wednesday it was well placed to surpass its 10% annual order growth forecast, after its second-"
    },
    {
      "title": "India's L&T Tech quarterly revenue a tad above view, maintains FY26 outlook",
      "link": "https://finance.yahoo.com/news/indias-l-t-tech-quarterly-121404924.html",
      "publisher": "Reuters",
      "time": "2025-10-17T12:14:04Z",
      "summary": "(Reuters) -India's L&T Technology Services posted second-quarter revenue that was marginally above analysts' estimates on Friday, on the back of strength from the tech segment and North America"
    }
  ],
  "LTF.BO": [
    {
      "title": "Search Intel: LTF",
      "link": "https://www.google.com/search?q=LTF%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413065,
      "summary": "No direct news feed detected for LTF. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "M&M.BO": [
    {
      "title": "Kraft Heinz taps former Kellogg chief as its CEO as it prepares to split into 2 companies",
      "link": "https://finance.yahoo.com/news/kraft-heinz-taps-former-kellogg-172357865.html",
      "publisher": "Associated Press Finance",
      "time": "2025-12-16T17:23:57Z",
      "summary": "The former CEO of the Kellogg Co. has been tapped to lead Kraft Heinz as it prepares to split into two companies.  Kraft Heinz said Tuesday that Steve Cahillane will serve as CEO starting Jan. 1.  Once Kraft Heinz becomes two companies – which is expected to happen in the second half of next year – Cahillane will become the CEO of what is currently called Global Taste Elevation Co. That company will house some of Kraft Heinz’s biggest sellers, including Kraft Mac & Cheese, Philadelphia cream cheese and Heinz."
    },
    {
      "title": "Mars to close $36B Kellanova acquisition following EU approval",
      "link": "https://finance.yahoo.com/news/mars-close-36b-kellanova-acquisition-130000637.html",
      "publisher": "Food Dive",
      "time": "2025-12-08T13:00:00Z",
      "summary": "The merger, the largest since Kraft Heinz's combination in 2015, would create a snacking giant with a portfolio including M&Ms, Pringles and Pop-Tarts."
    },
    {
      "title": "India's tax cut keeps car sales buoyant in November",
      "link": "https://finance.yahoo.com/news/indias-tax-cut-keeps-car-111842833.html",
      "publisher": "Reuters",
      "time": "2025-12-01T11:18:42Z",
      "summary": "Dec 1 (Reuters) - India's top carmakers reported robust sales growth to dealers in November on Monday, boosted by an earlier tax reduction that lowered vehicle prices and spurred demand."
    },
    {
      "title": "Hyundai, Tata want India to drop fuel emission concessions seen benefiting Suzuki",
      "link": "https://finance.yahoo.com/news/hyundai-tata-want-india-drop-232951217.html",
      "publisher": "Reuters",
      "time": "2025-11-30T23:29:51Z",
      "summary": "By Aditi Shah NEW DELHI, Nov 28 (Reuters) - India's biggest carmakers including Tata Motors and Hyundai want the government to scrap a weight-based emission concession for small cars under planned new"
    },
    {
      "title": "India's Mahindra accelerates EV push with new electric SUV launch",
      "link": "https://finance.yahoo.com/news/indias-mahindra-accelerates-ev-push-103540773.html",
      "publisher": "Reuters",
      "time": "2025-11-27T10:35:40Z",
      "summary": "By Meenakshi Maidas and Urvi Dugar BENGALURU (Reuters) - India's Mahindra launched a seven-seater electric SUV on Thursday with a starting price of around 2 million rupees ($22,409), as it eyes a"
    }
  ],
  "MANAPPURAM.BO": [
    {
      "title": "Indian gold loan provider Manappuram hits record high as Bain Capital plans stake buy",
      "link": "https://finance.yahoo.com/news/indian-gold-loan-provider-manappuram-064612998.html",
      "publisher": "Reuters",
      "time": "2025-03-21T06:46:12Z",
      "summary": "U.S. private equity firm Bain Capital will subscribe to Manappuram's shares and warrants at 236 rupees apiece, at a 9% premium over the stock's closing price on Thursday of 217.5 rupees.  After the investment, which is valued at $508 million, Bain Capital will jointly control Manappuram with other large shareholders, termed as 'promoters' under Indian regulations.  Manappuram's shares rose as much as 6.3% to 231.08 rupees - their highest level on record - as of 12:05 p.m. IST."
    },
    {
      "title": "Bain Capital to buy stake worth $508 million in India's Manappuram Finance",
      "link": "https://finance.yahoo.com/news/bain-capital-buy-18-stake-135248357.html",
      "publisher": "Reuters",
      "time": "2025-03-20T13:52:48Z",
      "summary": "The asset manager will subscribe to Manappuram's shares and warrants at 236 rupees apiece, implying a 30% premium over its six-month average trading price.  Bain Capital will be classified as a promoter of the company post-investment and will jointly control it with existing promoters.  Households in India, the world's second-biggest gold consumer, typically buy bullion during festivals and weddings."
    },
    {
      "title": "Manappuram Finance Ltd (BOM:531213) Q3 2025 Earnings Call Highlights: Navigating Challenges and ...",
      "link": "https://finance.yahoo.com/news/manappuram-finance-ltd-bom-531213-070808370.html",
      "publisher": "GuruFocus.com",
      "time": "2025-02-14T07:08:08Z",
      "summary": "Despite a significant drop in consolidated profit, Manappuram Finance Ltd (BOM:531213) shows resilience in core operations and outlines strategic plans for future growth."
    },
    {
      "title": "India's Manappuram Finance surges after central bank lifts ban on unit",
      "link": "https://finance.yahoo.com/news/indias-manappuram-finance-surges-central-040011821.html",
      "publisher": "Reuters",
      "time": "2025-01-09T04:00:11Z",
      "summary": "The Reserve Bank of India (RBI) had in October barred four non-banking financial companies (NBFCs), which included Manappuram's unit Asirvad Micro Finance, from issuing loans due to \"usurious\" pricing and high markups.  The central bank removed these restrictions with immediate effect on Wednesday, saying the companies initiated remedial measures and submitted compliance reports, satisfying the regulator.  Manappuram's shares had fallen 21% to a more than one-year low following the ban, but recovered to pre-ban levels in December."
    }
  ],
  "MUTHOOTFIN.BO": [
    {
      "title": "Muthoot Finance Ltd (BOM:533398) Q2 2026 Earnings Call Highlights: Robust Growth Amidst ...",
      "link": "https://finance.yahoo.com/news/muthoot-finance-ltd-bom-533398-190206689.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-13T19:02:06Z",
      "summary": "Muthoot Finance Ltd (BOM:533398) reports a 42% increase in loan assets and a 74% rise in profit, while navigating challenges in the microfinance sector and competitive gold loan market."
    },
    {
      "title": "India's Muthoot Finance posts quarterly profit jump, raises loan growth outlook",
      "link": "https://finance.yahoo.com/news/indias-muthoot-finance-posts-quarterly-111210607.html",
      "publisher": "Reuters",
      "time": "2025-11-13T11:12:10Z",
      "summary": "(Reuters) -Indian gold loan financier Muthoot Finance on Thursday reported an 87.5% jump in second-quarter profit on strong loan demand amid soaring prices of the precious metal, and raised its gold"
    },
    {
      "title": "India's Muthoot Finance surges to all-time high on hopes of stronger growth",
      "link": "https://finance.yahoo.com/news/indias-muthoot-finance-surges-10-040420335.html",
      "publisher": "Reuters",
      "time": "2025-08-14T04:04:20Z",
      "summary": "Muthoot's shares looked set to gain the most since June 2020, and were last up at a record 2,760.80 rupees.  Jefferies analysts raised Muthoot's fiscal 2026 earnings per share estimates by nearly a fifth, citing stronger loan growth and lower credit costs.  Analysts at Nuvama said Muthoot's earnings were \"substantially better than peers,\" adding that company is confident of maintaining growth."
    },
    {
      "title": "Muthoot Finance Ltd (BOM:533398) Q4 2025 Earnings Call Highlights: Record Loan Growth and ...",
      "link": "https://finance.yahoo.com/news/muthoot-finance-ltd-bom-533398-150114889.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-15T15:01:14Z",
      "summary": "Muthoot Finance Ltd (BOM:533398) reports a 37% AUM growth and a 20% profit increase, while navigating new regulatory landscapes and competitive pressures."
    },
    {
      "title": "India's Muthoot Finance says tighter regulations may push customers to unorganised lenders",
      "link": "https://finance.yahoo.com/news/indias-muthoot-finance-beats-profit-115335137.html",
      "publisher": "Reuters",
      "time": "2025-05-14T11:53:35Z",
      "summary": "BENGALURU (Reuters) -Indian gold loan financier Muthoot Finance said on Wednesday the central bank's proposed gold loan regulations, particularly the loan-to-value (LTV) ratio limit, could drive borrowers away from formal lenders and into the hands of unregulated players.  Last Month, the Reserve Bank of India put forward tighter guidelines for lenders disbursing gold-secured loans, aiming to enhance underwriting processes, improve collateral management and monitor the end-use of such funds.  The central bank proposed a LTV ratio limit of 75% which would apply throughout the loan tenure and not just at origination — a move analysts say would effectively make the product less attractive to borrowers."
    }
  ],
  "NATCOPHARM.BO": [
    {
      "title": "Natco Pharma Ltd (BOM:524816) Q2 2026 Earnings Call Highlights: Strategic Wins and Future ...",
      "link": "https://finance.yahoo.com/news/natco-pharma-ltd-bom-524816-170138174.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-14T17:01:38Z",
      "summary": "Natco Pharma Ltd (BOM:524816) outlines its revenue expectations, strategic expansions, and innovative investments amidst competitive challenges."
    },
    {
      "title": "India's stock benchmarks hit 10-week highs on Fed rate cut, optimism over US trade talks",
      "link": "https://finance.yahoo.com/news/indias-stock-benchmarks-hit-10-102946620.html",
      "publisher": "Reuters",
      "time": "2025-09-18T10:29:46Z",
      "summary": "India's benchmark shares rose on Thursday, closing at 10-week high levels, led by IT and pharmaceutical shares after the U.S. Federal Reserve delivered a quarter-point rate cut and on signs of easing trade tensions.  The Nifty 50 gained 0.37% to 25,423.60, and the BSE Sensex rose 0.39% to 83,013.96.  Shares of information technology and pharmaceutical firms, which earn a significant share of their revenue from the U.S., rose 0.8% and 1.5% respectively."
    },
    {
      "title": "Natco Pharma Ltd (BOM:524816) Q4 2025 Earnings Call Highlights: Record Profits Amid Future ...",
      "link": "https://finance.yahoo.com/news/natco-pharma-ltd-bom-524816-070039066.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-30T07:00:39Z",
      "summary": "Natco Pharma Ltd (BOM:524816) reports its highest ever revenue and profits, while projecting a dip in FY26 due to geopolitical and market pressures."
    },
    {
      "title": "Natco Pharma Ltd (BOM:524816) Q3 2025 Earnings Call Highlights: Navigating Challenges with ...",
      "link": "https://finance.yahoo.com/news/natco-pharma-ltd-bom-524816-070132046.html",
      "publisher": "GuruFocus.com",
      "time": "2025-02-14T07:01:32Z",
      "summary": "Despite a dip in revenue and profit, Natco Pharma Ltd (BOM:524816) focuses on new product launches and strategic acquisitions to drive future growth."
    }
  ],
  "PETRONET.BO": [
    {
      "title": "Petronet LNG Ltd (BOM:532522) Q2 2026 Earnings Call Highlights: Navigating Challenges with ...",
      "link": "https://finance.yahoo.com/news/petronet-lng-ltd-bom-532522-130035050.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-10T13:00:35Z",
      "summary": "Despite a dip in revenue, Petronet LNG Ltd (BOM:532522) focuses on future growth with terminal expansions and strong operational performance."
    },
    {
      "title": "India's Petronet LNG to get 500,000 T LNG from Exxon in 2026 under new deal",
      "link": "https://finance.yahoo.com/news/indias-petronet-lng-500-000-124702188.html",
      "publisher": "Reuters",
      "time": "2025-11-07T12:47:02Z",
      "summary": "By Nidhi Verma NEW DELHI (Reuters) -India's top gas importer Petronet LNG will receive 500,000 tons of liquefied natural gas (LNG) in 2026 in its 1.2 million ton per year supply deal with ExxonMobil"
    },
    {
      "title": "India's top gas importer Petronet seeks 120 billion rupee loan",
      "link": "https://finance.yahoo.com/news/indias-top-gas-importer-petronet-064854895.html",
      "publisher": "Reuters",
      "time": "2025-07-28T06:48:54Z",
      "summary": "NEW DELHI (Reuters) -India's top gas importer, Petronet LNG, is looking to raise a 120 billion rupee (about $1.4 billion) local currency loan to fund the expansion of a plant, its head of finance, Saurav Mitra, said in an analyst call on Monday.  The company is building a petrochemical plant in India's western state of Gujarat at the cost of 206.85 billion rupees.  Petronet aims to spend 300 billion rupees in the next few years, and most of that on building a petrochemical project, Mitra said."
    },
    {
      "title": "Petronet LNG and Performance Chemiserve enter LNG regasification agreement",
      "link": "https://finance.yahoo.com/news/petronet-lng-performance-chemiserve-enter-144832165.html",
      "publisher": "Offshore Technology",
      "time": "2025-07-11T14:48:32Z",
      "summary": "The contract involves the regasification of LNG to be imported by DFPCL."
    },
    {
      "title": "Petronet LNG Ltd (BOM:532522) Q4 2025 Earnings Call Highlights: Record Profits and Strategic ...",
      "link": "https://finance.yahoo.com/news/petronet-lng-ltd-bom-532522-070056942.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-21T07:00:56Z",
      "summary": "Petronet LNG Ltd (BOM:532522) reports record profits and throughput, while navigating high spot prices and regulatory hurdles."
    }
  ],
  "PGINVIT.BO": [
    {
      "title": "Search Intel: PGINVIT",
      "link": "https://www.google.com/search?q=PGINVIT%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413068,
      "summary": "No direct news feed detected for PGINVIT. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "POWERGRID.BO": [
    {
      "title": "KETRACO signs PPP for two high-voltage electricity transmission lines in Kenya",
      "link": "https://finance.yahoo.com/news/ketraco-signs-ppp-two-high-092505136.html",
      "publisher": "Power Technology",
      "time": "2025-12-16T09:25:05Z",
      "summary": "The project fully aligns with Kenya’s Least Cost Power Development Plan."
    },
    {
      "title": "Power Grid Corp Of India Ltd (BOM:532898) Q2 2026 Earnings Call Highlights: Strong Operational ...",
      "link": "https://finance.yahoo.com/news/power-grid-corp-india-ltd-170149130.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-04T17:01:49Z",
      "summary": "Power Grid Corp Of India Ltd (BOM:532898) reports high availability rates and international expansion, but faces equipment shortages and project delays."
    },
    {
      "title": "India's Power Grid Corp posts profit decline due on higher expenses, delayed projects",
      "link": "https://finance.yahoo.com/news/indias-power-grid-corp-posts-134234871.html",
      "publisher": "Reuters",
      "time": "2025-11-03T13:42:34Z",
      "summary": "(Reuters) -Power Grid Corporation of India posted a nearly 6% fall in second-quarter profit due to higher expenses and delayed project awards and execution."
    },
    {
      "title": "Indian power regulator takes up solar firms' plea on losses due to transmission delays",
      "link": "https://finance.yahoo.com/news/indian-power-regulator-takes-solar-102316351.html",
      "publisher": "Reuters",
      "time": "2025-10-06T10:23:16Z",
      "summary": "By Sethuraman N R NEW DELHI (Reuters) -India's federal power regulator has admitted petitions filed by two renewable energy developers seeking compensation for financial losses incurred due to delays"
    },
    {
      "title": "Corporate bond fundraising in India set to hit new highs as firms chase low-cost capital",
      "link": "https://finance.yahoo.com/news/corporate-bond-fundraising-india-set-085501294.html",
      "publisher": "Reuters",
      "time": "2025-08-11T08:55:01Z",
      "summary": "MUMBAI (Reuters) -India's record run in corporate bond issuance is expected to continue through August, as higher-rated companies and banks rush to tap the market for cheaper fundraising, underscoring a broader shift in corporate financing strategies amid declining bond yields and ample liquidity, investors said on Monday.  Indian firms are expected to raise at least 300 billion rupees ($3.43 billion) via bonds over the next three weeks, traders said.  Issuers including Manipal Hospitals, State Bank of India, IRB Infrastructure Trust, Delhi International Airport, Torrent Investments, Power Grid Corp and GMR Airports are among those expected to tap the market this month."
    }
  ],
  "RELIANCE.BO": [
    {
      "title": "How Recent Shifts Are Changing What Analysts Think Gives Reliance Industries The Edge",
      "link": "https://finance.yahoo.com/news/recent-shifts-changing-analysts-think-011002954.html",
      "publisher": "Simply Wall St.",
      "time": "2025-12-17T01:10:02Z",
      "summary": "Reliance Industries' long term narrative has been nudged higher, with fair value estimates inching up from about ₹1,696.9 to roughly ₹1,700.8 per share as analysts gain incremental confidence in the durability of its growth platforms. This slight uplift, alongside an unchanged discount rate near 12.76% and steady revenue growth expectations of around 6.28%, reflects a cautiously stronger conviction in the company’s ability to execute across its diversified businesses. Investors can monitor..."
    },
    {
      "title": "Amazon to invest over $35 billion in India on AI, exports",
      "link": "https://finance.yahoo.com/news/amazon-invest-over-35-billion-050257244.html",
      "publisher": "Reuters",
      "time": "2025-12-10T05:02:57Z",
      "summary": "Amazon plans to invest more than $35 billion in India by 2030 to expand its operations ​by boosting artificial intelligence capabilities and increasing exports, the ‌U.S. e-commerce giant said on Wednesday, as global tech firms deepen their presence ‌in Asia's third-largest economy.  Major U.S. tech firms have poured billions of dollars into India this year, underscoring the country's emergence as a strategic hub for cloud, AI and deep‑tech growth.  Microsoft pledged an investment ⁠of $17.5  billion in India for ‌AI and cloud infrastructure by 2030 on Tuesday, marking its largest investment in Asia, while Google ‍has committed $15  billion over the next five years to build AI data centers."
    },
    {
      "title": "Reliance-Disney's JioHotstar to invest $444 million in south Indian content, executive says",
      "link": "https://finance.yahoo.com/news/reliance-disneys-jiohotstar-invest-444-133111191.html",
      "publisher": "Reuters",
      "time": "2025-12-09T13:31:11Z",
      "summary": "India's JioHotstar plans to invest $444 million over five years to acquire and produce content from south India, an executive ​said on Monday, as the Walt Disney and Reliance Industries-owned streaming ‌platform seeks to capitalize on growing demand for regional cinema.  The expansion comes at a time when ‌the Mumbai-based Hindi film industry is struggling to regain its allure in the world's most-populous country even as south Indian films gain wider acceptance locally and globally, rivaling Hindi films' box-office performance.  \"To reiterate our belief in this market, we are committed ⁠to spend 40 billion ‌rupees ... over the (next) 5 years on JioHotstar,\" said Krishnan Kutty, the head of entertainment for southern India at JioStar, the Reliance-Disney ‍joint venture that runs the streaming platform."
    },
    {
      "title": "India’s Reliance Retail completes consumer business restructuring",
      "link": "https://finance.yahoo.com/news/india-reliance-retail-completes-consumer-120858536.html",
      "publisher": "Retail Insight Network",
      "time": "2025-12-03T12:08:58Z",
      "summary": "The new company has become a direct subsidiary of RIL, with RIL now holding an 83.56% stake."
    },
    {
      "title": "The Bull Case For Digital Realty Trust (DLR) Could Change Following Massive India AI Data Center Push",
      "link": "https://finance.yahoo.com/news/bull-case-digital-realty-trust-101024143.html",
      "publisher": "Simply Wall St.",
      "time": "2025-12-03T10:10:24Z",
      "summary": "Recently, Digital Realty Trust revealed a joint venture with Reliance Industries and Brookfield Corporation to invest US$11.00 billion in AI-focused data capacity in Andhra Pradesh, India, alongside a US$373.00 million power equipment supply agreement with Schneider Electric and an expanded AI infrastructure collaboration with NVIDIA in Northern Virginia. Together, these moves suggest Digital Realty is working to secure key power equipment, hyperscale partners, and AI workloads across both..."
    }
  ],
  "SOUTHBANK.BO": [
    {
      "title": "Search Intel: SOUTHBANK",
      "link": "https://www.google.com/search?q=SOUTHBANK%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413070,
      "summary": "No direct news feed detected for SOUTHBANK. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "STOVEKRAFT.BO": [
    {
      "title": "Search Intel: STOVEKRAFT",
      "link": "https://www.google.com/search?q=STOVEKRAFT%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413070,
      "summary": "No direct news feed detected for STOVEKRAFT. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "SUNPHARMA.BO": [
    {
      "title": "India's Sun Pharma beats Q2 profit estimates, targets growth through drug launches",
      "link": "https://finance.yahoo.com/news/indias-sun-pharma-beats-q2-145341320.html",
      "publisher": "Reuters",
      "time": "2025-11-05T14:53:41Z",
      "summary": "By Rishika Sadam and Kashish Tandon (Reuters) -Sun Pharmaceutical Industries, India's top drugmaker by revenue, reported quarterly profit above analysts' estimates on Wednesday, helped by strong"
    },
    {
      "title": "Cipher Receives \"Successful\" Arbitration Award in Contractual Dispute With Sun Pharma",
      "link": "https://finance.yahoo.com/news/cipher-receives-successful-arbitration-award-122931084.html",
      "publisher": "MT Newswires",
      "time": "2025-10-14T12:29:31Z",
      "summary": "Cipher Pharmaceuticals (CPH.TO) said Tuesday it has received a favorable award of $4.2 million from"
    },
    {
      "title": "Indian pharma stocks fall after Trump's new drug tariffs; mostly 'sentimental', say analysts",
      "link": "https://finance.yahoo.com/news/indian-pharma-stocks-fall-trumps-092428114.html",
      "publisher": "Reuters",
      "time": "2025-09-26T09:24:28Z",
      "summary": "By Ananta Agarwal and Rishika Sadam (Reuters) -Indian pharmaceutical stocks fell 2% on Friday after U.S."
    },
    {
      "title": "US FDA deems Sun Pharma's Halol plant not compliant with its manufacturing rules",
      "link": "https://finance.yahoo.com/news/us-fda-deems-sun-pharmas-200015494.html",
      "publisher": "Reuters",
      "time": "2025-09-09T20:00:15Z",
      "summary": "The classification of the plant as \"Official Action Indicated\" by the FDA follows an inspection from June 2 to June 13 that resulted in eight observations or instances of non-compliance, the company said.  Sun Pharma said the facility is under an import alert, restricting shipments to the United States except for certain products exempted due to drug shortages.  The restrictions will remain until the site meets FDA compliance standards."
    },
    {
      "title": "India's Gland Pharma posts quarterly profit rise on Cenexi recovery, Europe sales growth",
      "link": "https://finance.yahoo.com/news/indias-gland-pharma-posts-quarterly-115137418.html",
      "publisher": "Reuters",
      "time": "2025-08-05T11:51:37Z",
      "summary": "India's Gland Pharma reported a nearly 50% jump in first-quarter profit on Tuesday, driven by better margins and a recovery at its European unit Cenexi. The company reported a consolidated net profit of 2.15 billion rupees ($24.50 million) for the quarter ended June 30, from 1.44 billion rupees in the year-ago quarter. Revenue from operations rose 7.4% to 15.06 billion rupees."
    }
  ],
  "TATACHEM.BO": [
    {
      "title": "Tata Chemicals Ltd (BOM:500770) Q2 2026 Earnings Call Highlights: Strong Standalone Growth Amid ...",
      "link": "https://finance.yahoo.com/news/tata-chemicals-ltd-bom-500770-170200864.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-03T17:02:00Z",
      "summary": "Tata Chemicals Ltd (BOM:500770) reports robust standalone performance with significant revenue and profit growth, despite facing global market pressures and geopolitical risks."
    },
    {
      "title": "Tata Chemicals Ltd (BOM:500770) Q4 2025 Earnings Call Highlights: Navigating Challenges and ...",
      "link": "https://finance.yahoo.com/news/tata-chemicals-ltd-bom-500770-071908407.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-08T07:19:08Z",
      "summary": "Despite a challenging quarter, Tata Chemicals Ltd (BOM:500770) focuses on strategic expansions and operational efficiencies to drive future growth."
    },
    {
      "title": "Tata Chemicals Ltd (BOM:500770) Q3 2025 Earnings Call Highlights: Navigating Pricing Pressures ...",
      "link": "https://finance.yahoo.com/news/tata-chemicals-ltd-bom-500770-130035989.html",
      "publisher": "GuruFocus.com",
      "time": "2025-02-04T13:00:35Z",
      "summary": "Tata Chemicals Ltd (BOM:500770) focuses on operational efficiency and strategic expansion amidst challenging market conditions."
    }
  ],
  "TATAINVEST.BO": [
    {
      "title": "Top trending global stocks of 2024",
      "link": "https://finance.yahoo.com/news/top-trending-global-stocks-2024-052557191.html",
      "publisher": "Yahoo Finance UK",
      "time": "2024-12-23T05:26:57Z",
      "summary": "Here are the stocks that have reflected the key market trends of 2024 and have been closely watched by investors."
    }
  ],
  "TATAMOTORS.BO": [
    {
      "title": "Tata Motors Passenger Vehicles Ltd (BOM:500570) Q2 2026 Earnings Call Highlights: Strong ...",
      "link": "https://finance.yahoo.com/news/tata-motors-passenger-vehicles-ltd-190149859.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-14T19:01:49Z",
      "summary": "Despite a cyber incident impacting production, Tata Motors Passenger Vehicles Ltd (BOM:500570) reports robust domestic performance and significant strides in EV penetration."
    },
    {
      "title": "Italy grants conditional approval to Tata Motors’ €3.8bn purchase of Iveco",
      "link": "https://finance.yahoo.com/news/italy-grants-conditional-approval-tata-171111999.html",
      "publisher": "Just Auto",
      "time": "2025-11-10T17:11:11Z",
      "summary": "The acquisition is structured to maintain Iveco’s operational independence."
    },
    {
      "title": "Italy approves with conditions Iveco sale to Tata Motors, document shows",
      "link": "https://finance.yahoo.com/news/italy-approves-conditions-iveco-sale-143429484.html",
      "publisher": "Reuters",
      "time": "2025-11-07T14:34:29Z",
      "summary": "ROME (Reuters) -The Italian government has given its conditional approval to the sale of truck-maker Iveco to India's Tata Motors, a parliamentary document showed on Friday."
    },
    {
      "title": "Motherson Sumi Wiring India's quarterly profit climbs on festive demand",
      "link": "https://finance.yahoo.com/news/motherson-sumi-wiring-indias-quarterly-090500608.html",
      "publisher": "Reuters",
      "time": "2025-11-05T09:05:00Z",
      "summary": "(Reuters) -Motherson Sumi Wiring India posted a rise in second-quarter profit on Wednesday, boosted by production ramp-up in a greenfield plant and festive demand."
    },
    {
      "title": "Indian automaker Mahindra posts higher profit on strong SUV sales",
      "link": "https://finance.yahoo.com/news/indian-automaker-mahindra-posts-higher-080928283.html",
      "publisher": "Reuters",
      "time": "2025-11-04T08:09:28Z",
      "summary": "(Reuters) -Indian automaker Mahindra & Mahindra posted a nearly 18% rise in second-quarter profit on Tuesday, driven by steady demand for its high-margin sport-utility vehicles and tractors, and"
    }
  ],
  "TATASTEEL.BO": [
    {
      "title": "Tata Steel Ltd (STU:HWHG) Q2 2026 Earnings Call Highlights: Strong Revenue Growth Amid UK Challenges",
      "link": "https://finance.yahoo.com/news/tata-steel-ltd-stu-hwhg-010051635.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-20T01:00:51Z",
      "summary": "Tata Steel Ltd (STU:HWHG) reports robust revenue and EBITDA growth, driven by cost transformation and strong domestic performance, despite widening losses in the UK market."
    },
    {
      "title": "Tata Steel calls for extension of import tariffs on some steel products to India",
      "link": "https://finance.yahoo.com/news/tata-steel-calls-extension-import-124901388.html",
      "publisher": "Reuters",
      "time": "2025-11-13T12:49:01Z",
      "summary": "By Neha Arora and Sethuraman N R NEW DELHI (Reuters) -India's Tata Steel hopes the government will extend import tariffs on some steel products to guard against the threat of imports, particularly"
    },
    {
      "title": "India's Tata Steel quarterly profit soars on strong demand in key markets",
      "link": "https://finance.yahoo.com/news/indias-tata-steel-quarterly-profit-132158399.html",
      "publisher": "Reuters",
      "time": "2025-11-12T13:21:58Z",
      "summary": "(Reuters) -Tata Steel, India's second-largest maker of the alloy by market cap, reported a nearly four-fold rise in quarterly profit on Wednesday, as robust demand in its key markets and lower tax"
    },
    {
      "title": "Fast chargers are ‘critical’ for EV industry to sustain growth, says Tata Elxsi CEO",
      "link": "https://finance.yahoo.com/news/fast-chargers-critical-ev-industry-054721716.html",
      "publisher": "Euronews",
      "time": "2025-11-03T05:47:21Z",
      "summary": "“Unless the charging infrastructure keeps up, it will be difficult for the EV industry to sustain growth,” said Tata Elxsi CEO Manoj Raghavan.View on euronews"
    },
    {
      "title": "Tata's charity arm ousts key member Mistry from board, source says",
      "link": "https://finance.yahoo.com/news/tatas-charity-arm-ousts-key-103636605.html",
      "publisher": "Reuters",
      "time": "2025-10-28T10:36:36Z",
      "summary": "NEW DELHI (Reuters) -Tata Group's charity arm Tata Trusts has voted to oust businessman Mehli Mistry from its board, a person with direct knowledge of the matter said, the latest instance of boardroom"
    }
  ],
  "TCS.BO": [
    {
      "title": "Infosys Pares Gains After Stock Spike. No One Knows What Prompted the Move.",
      "link": "https://www.barrons.com/articles/infosys-stock-price-halt-gain-0d17b503?siteid=yhoof2&yptr=yahoo",
      "publisher": "Barrons.com",
      "time": "2025-12-19T19:21:00Z",
      "summary": "Infosys has been under pressure this year on changes to H-1B visas pushed through by the Trump administration."
    },
    {
      "title": "Aviva expands policy administration with TCS subsidiary Diligenta",
      "link": "https://finance.yahoo.com/news/aviva-expands-policy-administration-tcs-100339082.html",
      "publisher": "Life Insurance International",
      "time": "2025-12-19T10:03:39Z",
      "summary": "Diligenta will administer an additional 1.1 million life insurance policies under this expanded arrangement."
    },
    {
      "title": "Is Microsoft Corporation (MSFT) One of Billionaire David Tepper’s Top Stock Picks Heading into 2026?",
      "link": "https://finance.yahoo.com/news/microsoft-corporation-msft-one-billionaire-061513753.html",
      "publisher": "Insider Monkey",
      "time": "2025-12-18T06:15:13Z",
      "summary": "Microsoft Corporation (NASDAQ:MSFT) is one of billionaire David Tepper’s top stock picks heading into 2026. On December 11, the company inked a strategic partnership with Cognizant, Infosys, TCS, and Wipro. The leading IT companies are joining forces with the software giant to accelerate the development and adoption of agentic AI. As part of the agreement, […]"
    },
    {
      "title": "Tata and Infosys to Bear Brunt of Trump’s $100,000 H-1B Worker Fee",
      "link": "https://finance.yahoo.com/news/tata-infosys-bear-brunt-trump-172928192.html",
      "publisher": "Bloomberg",
      "time": "2025-12-16T23:00:57Z",
      "summary": "President Donald Trump’s $100,000 price tag for new H-1B workers hired from outside the US could have punishing effects for the IT outsourcing and staffing industries that have long been a target of both parties.  The fee is the biggest restriction the Trump administration has imposed so far on employment of skilled foreign workers.  A Bloomberg News analysis found it could have a disproportionate impact on multinational staffing firms that act as middlemen for companies seeking H-1B workers."
    },
    {
      "title": "Sector Update: Tech Stocks Fall Late Afternoon",
      "link": "https://finance.yahoo.com/news/sector-tech-stocks-fall-afternoon-205148781.html",
      "publisher": "MT Newswires",
      "time": "2025-12-15T20:51:48Z",
      "summary": "Tech stocks declined late Monday afternoon, with the State Street Technology Select Sector SPDR ETF"
    }
  ],
  "TECHM.BO": [
    {
      "title": "How Recent Analyst Shifts Are Rewriting the Story for Tech Mahindra",
      "link": "https://finance.yahoo.com/news/recent-analyst-shifts-rewriting-story-190910715.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-29T19:09:10Z",
      "summary": "Tech Mahindra's stock price target has been revised upward, with the fair value estimate rising from ₹1,568.60 to ₹1,577.74. This increase follows analysts' consideration of both improved business fundamentals and a dynamic, mixed outlook for the company. Read on to learn what is influencing these updates and how you can keep track of the evolving narrative surrounding Tech Mahindra's valuation. Analyst Price Targets don't always capture the full story. Head over to our Company Report to find..."
    },
    {
      "title": "How New Partnerships and Analyst Shifts Are Shaping the Story for Tech Mahindra",
      "link": "https://finance.yahoo.com/news/partnerships-analyst-shifts-shaping-story-171548986.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-15T17:15:48Z",
      "summary": "Tech Mahindra's consensus analyst price target has seen a marginal decrease, moving from ₹1,570.83 to ₹1,568.60. This subtle adjustment reflects both the company’s operational strengths and the caution present in today's market outlook. Read on to find out how you can keep up with the evolving story behind Tech Mahindra’s stock and what these shifts could mean for future updates. Stay updated as the Fair Value for Tech Mahindra shifts by adding it to your watchlist or portfolio..."
    },
    {
      "title": "Route Mobile Ltd (BOM:543228) Q2 2026 Earnings Call Highlights: Strong Revenue Growth Amidst ...",
      "link": "https://finance.yahoo.com/news/route-mobile-ltd-bom-543228-090115021.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-05T09:01:15Z",
      "summary": "Route Mobile Ltd (BOM:543228) reports a 6.5% revenue increase and strategic partnerships, despite facing profitability pressures from exceptional items."
    },
    {
      "title": "Mahindra & Mahindra Ltd (MAHMF) Q2 2026 Earnings Call Highlights: Strong Growth Across ...",
      "link": "https://finance.yahoo.com/news/mahindra-mahindra-ltd-mahmf-q2-170052813.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-04T17:00:52Z",
      "summary": "Mahindra & Mahindra Ltd (MAHMF) reports robust revenue and profit growth, with significant gains in farm and auto sectors despite GST-related challenges."
    },
    {
      "title": "Why Analysts See the Tech Mahindra Story Evolving With Digital Growth and New Partnerships",
      "link": "https://finance.yahoo.com/news/why-analysts-see-tech-mahindra-141152616.html",
      "publisher": "Simply Wall St.",
      "time": "2025-11-01T14:11:52Z",
      "summary": "Tech Mahindra's consensus analyst price target remains unchanged at ₹1,570.83, which signals continued confidence in the company's fair value. Despite a marginal uptick in the discount rate, analysts are maintaining their revenue growth projections, underlining a steady outlook for the firm. As the narrative around Tech Mahindra continues to evolve with both risks and opportunities, stay tuned to see how you can keep up with future shifts in analyst sentiment. Stay updated as the Fair Value..."
    }
  ],
  "THANGAMAYL.BO": [
    {
      "title": "Search Intel: THANGAMAYL",
      "link": "https://www.google.com/search?q=THANGAMAYL%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413075,
      "summary": "No direct news feed detected for THANGAMAYL. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "TITAN.BO": [
    {
      "title": "Titan Co Ltd (BOM:500114) Q2 2026 Earnings Call Highlights: Strong Festive Sales and Strategic ...",
      "link": "https://finance.yahoo.com/news/titan-co-ltd-bom-500114-170036939.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-04T17:00:36Z",
      "summary": "Titan Co Ltd (BOM:500114) reports robust growth across segments despite challenges from high gold prices and competitive pressures."
    },
    {
      "title": "Indian shares drop as broader profit booking dampens earnings optimism",
      "link": "https://finance.yahoo.com/news/indian-shares-drop-broader-profit-101320759.html",
      "publisher": "Reuters",
      "time": "2025-11-04T10:13:20Z",
      "summary": "By Bharath Rajeswaran and Vivek Kumar M (Reuters) -India's equity benchmarks slipped on Tuesday as profit booking led by IT stocks outweighed earnings-driven gains in Bharti Airtel and Titan Company."
    },
    {
      "title": "Indian jeweller Titan posts slower sales as surge in gold prices dent demand",
      "link": "https://finance.yahoo.com/news/indian-jeweller-titan-posts-slower-131549383.html",
      "publisher": "Reuters",
      "time": "2025-10-07T13:15:49Z",
      "summary": "(Reuters) -India's Titan Company reported an 18% rise in domestic sales in the second quarter on Tuesday, slower than the 25% it registered during the same period last year, as soaring gold prices"
    }
  ],
  "TMB.BO": [
    {
      "title": "Search Intel: TMB",
      "link": "https://www.google.com/search?q=TMB%20share%20news&tbm=nws",
      "publisher": "Google News Search",
      "time": 1766413076,
      "summary": "No direct news feed detected for TMB. This fallback link will execute a secure search for the latest market intelligence on Google News."
    }
  ],
  "TTKPRESTIG.BO": [
    {
      "title": "Indian kitchenware maker TTK Prestige's quarterly profit jumps on premium offerings",
      "link": "https://finance.yahoo.com/news/indian-kitchenware-maker-ttk-prestiges-073424411.html",
      "publisher": "Reuters",
      "time": "2025-10-28T07:34:24Z",
      "summary": "(Reuters) -India's kitchenware maker TTK Prestige reported a nearly 22% rise in its second-quarter profit on Tuesday, driven by mass-priced launches in smaller towns and margin-boosting premium"
    },
    {
      "title": "TTK Prestige Ltd (BOM:517506) Q4 2025 Earnings Call Highlights: Navigating Growth Amidst Margin ...",
      "link": "https://finance.yahoo.com/news/ttk-prestige-ltd-bom-517506-070206595.html",
      "publisher": "GuruFocus.com",
      "time": "2025-05-28T07:02:06Z",
      "summary": "TTK Prestige Ltd (BOM:517506) reports steady sales growth and strategic investments, despite facing challenges in margins and operational expenses."
    },
    {
      "title": "Indian kitchen appliances maker TTK Prestige to grow stores by 30% in 4 years, CEO says",
      "link": "https://finance.yahoo.com/news/indian-kitchen-appliances-maker-ttk-064108074.html",
      "publisher": "Reuters",
      "time": "2025-02-28T06:41:08Z",
      "summary": "India's kitchen appliances maker TTK Prestige plans to expand its store count by up to 30% over four years, as it bets the government's income tax relief will aid consumer spending, a top executive said on Thursday.  To boost demand, TTK Prestige will expand in large towns, while also targeting growth in smaller ones, where consumption is increasing, CEO Venkatesh Vijayaraghavan said.  The expansion plan comes at a time when consumer spending is slowing in urban India, which in part resulted in a 6.4% annual drop in the company's profit in the October-to-December period."
    },
    {
      "title": "TTK Prestige Ltd (BOM:517506) Q3 2025 Earnings Call Highlights: Navigating Market Challenges ...",
      "link": "https://finance.yahoo.com/news/ttk-prestige-ltd-bom-517506-070226161.html",
      "publisher": "GuruFocus.com",
      "time": "2025-01-31T07:02:26Z",
      "summary": "TTK Prestige Ltd (BOM:517506) reports stable urban demand and market share gains despite rural challenges and a 3% growth decline."
    }
  ],
  "WIPRO.BO": [
    {
      "title": "Stock Market Today, Dec. 19: NYSE Halts Infosys Trading After ADRs Spike",
      "link": "https://finance.yahoo.com/news/stock-market-today-dec-19-230204325.html",
      "publisher": "Motley Fool",
      "time": "2025-12-19T23:02:04Z",
      "summary": "Unusual trading halt and record volume spotlight rising volatility risks for U.S. investors in this tech leader, today, Dec. 19, 2025."
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Surge in Friday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-154004605.html",
      "publisher": "MT Newswires",
      "time": "2025-12-19T15:40:04Z",
      "summary": "Asian equities traded in the US as American depositary receipts were surging higher in Friday tradin"
    },
    {
      "title": "Is Microsoft Corporation (MSFT) One of Billionaire David Tepper’s Top Stock Picks Heading into 2026?",
      "link": "https://finance.yahoo.com/news/microsoft-corporation-msft-one-billionaire-061513753.html",
      "publisher": "Insider Monkey",
      "time": "2025-12-18T06:15:13Z",
      "summary": "Microsoft Corporation (NASDAQ:MSFT) is one of billionaire David Tepper’s top stock picks heading into 2026. On December 11, the company inked a strategic partnership with Cognizant, Infosys, TCS, and Wipro. The leading IT companies are joining forces with the software giant to accelerate the development and adoption of agentic AI. As part of the agreement, […]"
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Decline in Wednesday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-155609185.html",
      "publisher": "MT Newswires",
      "time": "2025-12-17T15:56:09Z",
      "summary": "Asian equities traded in the US as American depositary receipts were lower Wednesday morning, declin"
    },
    {
      "title": "Asian Equities Traded in the US as American Depositary Receipts Little Changed in Monday Trading",
      "link": "https://finance.yahoo.com/news/asian-equities-traded-us-american-153745171.html",
      "publisher": "MT Newswires",
      "time": "2025-12-15T15:37:45Z",
      "summary": "Asian equities traded in the US as American depositary receipts started the week little changed Mond"
    }
  ],
  "ZYDUSLIFE.BO": [
    {
      "title": "Formycon and Zydus sign exclusive agreement for FYB206 supply",
      "link": "https://finance.yahoo.com/news/formycon-zydus-sign-exclusive-agreement-110708711.html",
      "publisher": "Pharmaceutical Technology",
      "time": "2025-12-10T11:07:08Z",
      "summary": "On market launch of the product, Formycon will receive a mid–double-digit-share of gross profits in the region."
    },
    {
      "title": "Zydus Lifesciences Ltd (BOM:532321) Q2 2026 Earnings Call Highlights: Robust Revenue Growth ...",
      "link": "https://finance.yahoo.com/news/zydus-lifesciences-ltd-bom-532321-130044835.html",
      "publisher": "GuruFocus.com",
      "time": "2025-11-07T13:00:44Z",
      "summary": "Despite strong financial performance and strategic acquisitions, Zydus faces challenges with increased operating expenses and market uncertainties."
    },
    {
      "title": "Fortress Biotech Gets US FDA Letter for Deficiencies at Manufacturing Site; Stock Down 30% Premarket",
      "link": "https://finance.yahoo.com/news/fortress-biotech-gets-us-fda-130252526.html",
      "publisher": "MT Newswires",
      "time": "2025-10-01T13:02:52Z",
      "summary": "Fortress Biotech (FBIO) and its Cyprium Therapeutics unit said Wednesday that the US Food and Drug A"
    }
  ]
}